tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Modern replacement for 'ls'
brew "exa"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Linux virtual machines
brew "lima"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion360"
# Cloud storage service
cask "baidunetdisk"
# Keyboard, mouse and touchpad motion gestures
cask "betterandbetter"
# Desktop password and login vault
cask "bitwarden"
# Xcode extension for Github Copilot
cask "copilot-for-xcode"
# Tool to run Windows software
cask "crossover"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Switch input method per application
cask "keyboardholder"
# Open-source keystroke visualizer
cask "keycastr"
# Create custom keyboard shortcuts for anything
cask "keysmith"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Configurable global mouse gestures
cask "macstroke"
# Markdown editor
cask "miaoyan"
# Web browser
cask "microsoft-edge"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mouse-fix"
# Utility that provides NTFS read and write support
cask "ntfstool"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Instant messaging tool
cask "qq"
# Chinese music streaming application
cask "qqmusic"
# Better Finder alternative
cask "qspace-pro"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Input method supporting full and double spelling
cask "sogouinput"
# Rime input method engine
cask "squirrel"
# Network toolbox
cask "surge"
# Real time file synchronization software
cask "syncthing"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Cleanup and system status tool
cask "tencent-lemon"
# Cloud video conferencing
cask "tencent-meeting"
# Configurable document editor that supports Markdown
cask "typora"
# PKG software package uninstall tool
cask "uninstallpkg"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Free messaging and calling application
cask "wechat"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "vscodevim.vim"
vscode "withfig.fig"
